app/controllers/conversations_controller.rb

SELECT "conversations".* FROM "conversations" WHERE (sender_id = 4 OR receiver_id = 4)
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations"
---
  def index
    p current_user.id
    @conversations = Conversation.where("sender_id = ? OR receiver_id = ?", current_user.id, current_user.id)
    @users = User.where.not(id: current_user.id)

SELECT  "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @conversations = Conversation.find(params[:id])

SELECT  1 AS one FROM "conversations" WHERE "conversations"."sender_id" IS NULL AND "conversations"."receiver_id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" WHERE ((conversations.sender_id = NULL AND conversations.receiver_id = NULL) OR (conversations.receiver_id = NULL AND conversations.sender_id = NULL))
---
  def create
    if Conversation.between(params[:sender_id],params[:receiver_id])
      .present?