app/controllers/items_controller.rb

INSERT INTO "items" ("super_type", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["super_type", "Hardware"], ["user_id", 4], ["created_at", "2017-07-25 08:56:11.691702"], ["updated_at", "2017-07-25 08:56:11.691702"]]
---
  def create
    @item = Item.new(item_params)

    if @item.save

UPDATE "items" SET "title" = $1, "super_type" = $2, "location" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["title", "qweweqwe"], ["super_type", "qqqqqqqqqq"], ["location", "qqqqqqqq"], ["updated_at", "2017-07-24 09:49:19.839496"], ["id", 6]]
---
  def update
    if @item.update(item_params)