app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["conversation_id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "read" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["read", "t"], ["updated_at", "2017-07-24 15:13:49.312020"], ["id", 2]]
---
  def index
    @messages = @conversation.messages

    if @messages.last && @messages.last.user_id != current_user.id
      @messages.last.update(read: true)

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "asdsdasdadsd"], ["conversation_id", 4], ["user_id", 4], ["created_at", "2017-07-25 12:59:16.792049"], ["updated_at", "2017-07-25 12:59:16.792049"]]
---
  def create
    @message = @conversation.messages.new(message_params)

    if @message.save